#include <stdio.h>


//设计一个程序，机器当前的字节序
//大端小端
//a = 20；
//0x00 00 00 14
//大端 ： 00 00 00 14
//小端 ： 14 00 00 00
//地址从左到右升高
//int main()
//{	
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//
//	return 0;
//}


//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码
//
//	signed char b = -1;
//	//11111111
//
//	unsigned char c = -1;
//	//11111111 -> 整形提升
//	//0000000000000000000000011111111
//	//正数数原反补相同
//	//255
//	printf("a = %d,b = %d,c = %d", a, b, c);
//	//-1 -1 255
//	return 0;
//}


//%u  打印十进制无符号数


//char
//signed char
//unsigned char 
//一个字节 八个比特位
//00000000
//……
//11111111

//256 
//10000000 = -128


//有符号char -128 -- 127
//无符号char 0 -- 255
//
//int main()
//{
//	char a = 128;
//	char b = -128;
//	printf("%u %u", a, b);//打印相同结果
//	//char 存不下128  127+1=10000000 = -128
//	return 0;
//}