#include <stdio.h>

//int main()
//{
//	double d = 1E10;
//	printf("%lf\n", d);//1 X 10的十次方
//	return 0;
//}


//浮点数存储

//9.0
//1001.0
//(-1)^0 * 1.001 * 2^3
//(-1)^s * M     * 2^E
//^ 次方

//s - 0
//M - 1.001
//E - 3

//0.5
//0.1   2的负一次方乘以1=0.5
//（-1）^ 0 * 1.0 * 2 ^ (-1)
//E = -1
//E + 127 = 126 存进去的是126 实际表达时候减127变为-1

//int main()
//{
//	float f = 5.5;
	//5.5
	//101.1
	//(-1) ^ 0 * 1.011 * 2 ^ 2
	//S = 0
	//M = 1.011
	//E = 2
	//0 10000001 01100000000000000000000
	//S E-127=2  M（1.xxx的1不存进去，直接从.xx开始存，精度多一位）
	//0x40b00000
//
//	return 0;
//}



int main()
{
	int n = 9;
	float* pFloat = (float*)&n;
	//0 00000000 00000000000000000001001 - 补码
	printf("pFloat的值为：%lf\n", *pFloat);
	//(-1) ^ 0 * 0.00000000000000000001001 * 2 ^ -126(E为全零时真实值为-126)
	//结果无限接近0
}